benchmarkingExperiments/data/initial_experiments/16t16c300rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  16 threads and 16 connections
  Thread calibration: mean lat.: 20.284ms, rate sampling interval: 55ms
  Thread calibration: mean lat.: 17.962ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 19.406ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 19.710ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 20.428ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 20.347ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 19.837ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 19.588ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 20.342ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 21.203ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 20.965ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 20.278ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 19.408ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 19.126ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 19.952ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 19.864ms, rate sampling interval: 49ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    77.97ms  188.60ms 920.06ms   91.66%
    Req/Sec    18.54      8.28    65.00     82.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.77ms
 75.000%   22.88ms
 90.000%  146.56ms
 99.000%  870.91ms
 99.900%  905.73ms
 99.990%  914.94ms
 99.999%  920.58ms
100.000%  920.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.481     0.000000            1         1.00
      12.583     0.100000         1500         1.11
      15.031     0.200000         3005         1.25
      16.671     0.300000         4515         1.43
      17.791     0.400000         6001         1.67
      18.767     0.500000         7502         2.00
      19.311     0.550000         8256         2.22
      19.919     0.600000         8997         2.50
      20.639     0.650000         9754         2.86
      21.455     0.700000        10512         3.33
      22.879     0.750000        11244         4.00
      23.999     0.775000        11620         4.44
      25.711     0.800000        11995         5.00
      28.431     0.825000        12369         5.71
      35.839     0.850000        12744         6.67
      53.119     0.875000        13118         8.00
      89.727     0.887500        13307         8.89
     146.559     0.900000        13494        10.00
     230.399     0.912500        13681        11.43
     369.919     0.925000        13868        13.33
     519.679     0.937500        14055        16.00
     592.383     0.943750        14149        17.78
     656.895     0.950000        14243        20.00
     705.535     0.956250        14337        22.86
     749.567     0.962500        14430        26.67
     790.527     0.968750        14528        32.00
     805.375     0.971875        14572        35.56
     820.735     0.975000        14619        40.00
     834.559     0.978125        14665        45.71
     842.751     0.981250        14711        53.33
     854.527     0.984375        14759        64.00
     860.671     0.985938        14784        71.11
     865.791     0.987500        14806        80.00
     869.375     0.989062        14831        91.43
     873.983     0.990625        14852       106.67
     878.591     0.992188        14875       128.00
     880.639     0.992969        14887       142.22
     882.687     0.993750        14899       160.00
     885.247     0.994531        14912       182.86
     887.295     0.995313        14924       213.33
     890.879     0.996094        14934       256.00
     892.415     0.996484        14942       284.44
     893.951     0.996875        14946       320.00
     894.975     0.997266        14952       365.71
     895.999     0.997656        14957       426.67
     899.071     0.998047        14964       512.00
     899.583     0.998242        14966       568.89
     901.119     0.998437        14969       640.00
     902.655     0.998633        14972       731.43
     904.191     0.998828        14975       853.33
     906.751     0.999023        14978      1024.00
     907.263     0.999121        14979      1137.78
     907.775     0.999219        14981      1280.00
     908.287     0.999316        14982      1462.86
     910.335     0.999414        14984      1706.67
     910.847     0.999512        14986      2048.00
     910.847     0.999561        14986      2275.56
     911.359     0.999609        14988      2560.00
     911.359     0.999658        14988      2925.71
     911.359     0.999707        14988      3413.33
     912.895     0.999756        14990      4096.00
     912.895     0.999780        14990      4551.11
     912.895     0.999805        14990      5120.00
     912.895     0.999829        14990      5851.43
     912.895     0.999854        14990      6826.67
     914.943     0.999878        14991      8192.00
     914.943     0.999890        14991      9102.22
     914.943     0.999902        14991     10240.00
     914.943     0.999915        14991     11702.86
     914.943     0.999927        14991     13653.33
     920.575     0.999939        14992     16384.00
     920.575     1.000000        14992          inf
#[Mean    =       77.970, StdDeviation   =      188.595]
#[Max     =      920.064, Total count    =        14992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 1.00m, 3.21MB read
Requests/sec:    299.95
Transfer/sec:     54.78KB