benchmarkingExperiments/data/initial_experiments/16t16c400rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  16 threads and 16 connections
  Thread calibration: mean lat.: 20.136ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 19.266ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 17.524ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 19.049ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 20.381ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 19.885ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 20.046ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 21.112ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 19.891ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 19.212ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 19.896ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 20.011ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 20.083ms, rate sampling interval: 58ms
  Thread calibration: mean lat.: 19.489ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 19.734ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 20.088ms, rate sampling interval: 56ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   149.89ms  340.18ms   1.44s    88.77%
    Req/Sec    24.82     11.63    85.00     78.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.89ms
 75.000%   33.41ms
 90.000%  691.20ms
 99.000%    1.36s 
 99.900%    1.42s 
 99.990%    1.44s 
 99.999%    1.44s 
100.000%    1.44s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.127     0.000000            1         1.00
      12.967     0.100000         2004         1.11
      15.671     0.200000         4001         1.25
      17.391     0.300000         6005         1.43
      18.639     0.400000         8029         1.67
      19.887     0.500000        10012         2.00
      20.623     0.550000        11000         2.22
      21.535     0.600000        12019         2.50
      22.991     0.650000        13004         2.86
      25.919     0.700000        14002         3.33
      33.407     0.750000        15000         4.00
      44.863     0.775000        15500         4.44
      62.527     0.800000        16001         5.00
      91.199     0.825000        16500         5.71
     141.567     0.850000        17001         6.67
     281.599     0.875000        17500         8.00
     483.839     0.887500        17750         8.89
     691.199     0.900000        18000        10.00
     826.879     0.912500        18250        11.43
     966.143     0.925000        18500        13.33
    1060.863     0.937500        18754        16.00
    1113.087     0.943750        18876        17.78
    1164.287     0.950000        19000        20.00
    1204.223     0.956250        19128        22.86
    1246.207     0.962500        19252        26.67
    1279.999     0.968750        19376        32.00
    1295.359     0.971875        19438        35.56
    1309.695     0.975000        19504        40.00
    1321.983     0.978125        19565        45.71
    1331.199     0.981250        19628        53.33
    1339.391     0.984375        19694        64.00
    1344.511     0.985938        19722        71.11
    1349.631     0.987500        19754        80.00
    1355.775     0.989062        19783        91.43
    1360.895     0.990625        19816       106.67
    1367.039     0.992188        19848       128.00
    1369.087     0.992969        19865       142.22
    1372.159     0.993750        19875       160.00
    1375.231     0.994531        19893       182.86
    1379.327     0.995313        19909       213.33
    1384.447     0.996094        19926       256.00
    1385.471     0.996484        19930       284.44
    1389.567     0.996875        19938       320.00
    1393.663     0.997266        19947       365.71
    1396.735     0.997656        19954       426.67
    1400.831     0.998047        19961       512.00
    1407.999     0.998242        19965       568.89
    1412.095     0.998437        19970       640.00
    1415.167     0.998633        19973       731.43
    1418.239     0.998828        19978       853.33
    1423.359     0.999023        19982      1024.00
    1424.383     0.999121        19983      1137.78
    1425.407     0.999219        19985      1280.00
    1426.431     0.999316        19987      1462.86
    1429.503     0.999414        19989      1706.67
    1430.527     0.999512        19991      2048.00
    1431.551     0.999561        19992      2275.56
    1432.575     0.999609        19994      2560.00
    1432.575     0.999658        19994      2925.71
    1433.599     0.999707        19995      3413.33
    1434.623     0.999756        19996      4096.00
    1434.623     0.999780        19996      4551.11
    1435.647     0.999805        19997      5120.00
    1435.647     0.999829        19997      5851.43
    1437.695     0.999854        19998      6826.67
    1437.695     0.999878        19998      8192.00
    1437.695     0.999890        19998      9102.22
    1441.791     0.999902        19999     10240.00
    1441.791     0.999915        19999     11702.86
    1441.791     0.999927        19999     13653.33
    1441.791     0.999939        19999     16384.00
    1441.791     0.999945        19999     18204.44
    1442.815     0.999951        20000     20480.00
    1442.815     1.000000        20000          inf
#[Mean    =      149.893, StdDeviation   =      340.184]
#[Max     =     1441.792, Total count    =        20000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24001 requests in 1.00m, 4.28MB read
Requests/sec:    399.94
Transfer/sec:     73.04KB